#include "AppleStatic.h"

//-----------------------------------------------------------------------------
// @brief  コンストラクタ.
//-----------------------------------------------------------------------------
AppleStatic::AppleStatic(int sourceModelHandle)
	: EnemyBase(sourceModelHandle)
{
	
	hitRadius = 6.0f;
	pos = VGet(0.2f, 0.2f, 0.2f);
	MV1SetScale(modelHandle, pos);
}

//-----------------------------------------------------------------------------
// @brief  デストラクタ.
//-----------------------------------------------------------------------------
AppleStatic::~AppleStatic()
{
	// 処理なし.
}

//-----------------------------------------------------------------------------
// @brief  更新.
//-----------------------------------------------------------------------------
void AppleStatic::Update()
{

	MV1SetPosition(modelHandle, pos);

}
