#include "AppleStatic.h"

//-----------------------------------------------------------------------------
// @brief  コンストラクタ.
//-----------------------------------------------------------------------------
AppleStatic::AppleStatic(int _sourceModelHandle)
	: EnemyBase(_sourceModelHandle)
{
	
	hitRadius = 6.0f;//当たり判定の半径
	pos = VGet(0.2f, 0.2f, 0.2f);//リンゴのサイズを調整
	MV1SetScale(modelHandle, pos);//調整した値をモデルに設定した
}

//-----------------------------------------------------------------------------
// @brief  デストラクタ.
//-----------------------------------------------------------------------------
AppleStatic::~AppleStatic()
{
	// 処理なし.
}

//-----------------------------------------------------------------------------
// @brief  更新.
//-----------------------------------------------------------------------------
void AppleStatic::Update()
{

	MV1SetPosition(modelHandle, pos);//モデルの座標をセット

}
