//-----------------------------------------------------------------------------
//  フライパンの処理
//-----------------------------------------------------------------------------
#include "FryingPan.h"
#include "Enemy.h"
#include "EnemyStatic.h"
#include "Player.h"

#define _USE_MATH_DEFINES
#include <math.h>

//-----------------------------------------------------------------------------
//  コンストラクタ.
//-----------------------------------------------------------------------------
FryingPan::FryingPan(int _sourceModelHandle)
    :EnemyBase(_sourceModelHandle)
    , zcount(0)
{
    // ポジションの初期化
    pos = VGet(0, 0, 0);
    // sin移動のラジアン関数初期化
    m_rad = 0;
    // 当たり判定の半径
    hitRadius = 3.0f;

    // 投げる音読み込み
    m_panSound = LoadSoundMem("data/Sound/Frypan.mp3");

}
//-----------------------------------------------------------------------------
//  デストラクタ.
//-----------------------------------------------------------------------------
FryingPan::~FryingPan()
{
    //処理なし
}


//-----------------------------------------------------------------------------
//  更新.
//-----------------------------------------------------------------------------
void FryingPan::Update()
{
    m_rad += static_cast<float>((M_PI / 180) * 5);//static_castは暗黙の型変換を明示するもの。省略可

    //yの高さ、上下の揺れを作る
    pos.y = 10.0f + sinf(m_rad);


    zcount++;
    //zcount(もしくはフライパンの座標)が200移動したら
    if (zcount == 200)
    {
        // 移動した分の座標を戻す
        pos.z += 200;
        zcount = 0;

        // 音の再生を開始
        PlaySoundMem(m_panSound, DX_PLAYTYPE_BACK);
    }
    else
    {
        // zcountが1増えるとフライパンが1進む
        pos.z--;
    }

    //3Dモデルのポジション設定
    MV1SetPosition(modelHandle, pos);
}

